apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_flash.h
/****************************************************************************************************
 * arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_flash.h
 *
 *   Copyright (C) 2018 Gregory Nutt. All rights reserved.
 *   Authors: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************************************/

#ifndef __ARCH_ARM_SRC_TIVA_HARDWARE_CC13X2_CC26X2_CC13X2_CC26X2_FLASH_H
#define __ARCH_ARM_SRC_TIVA_HARDWARE_CC13X2_CC26X2_CC13X2_CC26X2_FLASH_H

/****************************************************************************************************
 * Included Files
 ****************************************************************************************************/

#include <nuttx/config.h>
#include "hardware/tiva_memorymap.h"

/****************************************************************************************************
 * Pre-processor Definitions
 ****************************************************************************************************/

/* FLASH Register Offsets ***************************************************************************/


#define FLASH_STAT_OFFSET               0x001c  /* FMC and Efuse Status */
#define FLASH_CFG_OFFSET                0x0024
#define FLASH_SYSCODE_START_OFFSET      0x0028
#define FLASH_FLASH_SIZE_OFFSET         0x002c
#define FLASH_FWLOCK_OFFSET             0x003c
#define FLASH_FWFLAG_OFFSET             0x0040
#define FLASH_EFUSE_OFFSET              0x1000
#define FLASH_EFUSEADDR_OFFSET          0x1004
#define FLASH_DATAUPPER_OFFSET          0x1008
#define FLASH_DATALOWER_OFFSET          0x100c
#define FLASH_EFUSECFG_OFFSET           0x1010
#define FLASH_EFUSESTAT_OFFSET          0x1014
#define FLASH_ACC_OFFSET                0x1018
#define FLASH_BOUNDARY_OFFSET           0x101c
#define FLASH_EFUSEFLAG_OFFSET          0x1020
#define FLASH_EFUSEKEY_OFFSET           0x1024
#define FLASH_EFUSERELEASE_OFFSET       0x1028
#define FLASH_EFUSEPINS_OFFSET          0x102c
#define FLASH_EFUSECRA_OFFSET           0x1030
#define FLASH_EFUSEREAD_OFFSET          0x1034
#define FLASH_EFUSEPROGRAM_OFFSET       0x1038
#define FLASH_EFUSEERROR_OFFSET         0x103c
#define FLASH_SINGLEBIT_OFFSET          0x1040
#define FLASH_TWOBIT_OFFSET             0x1044
#define FLASH_SELFTESTCYC_OFFSET        0x1048
#define FLASH_SELFTESTSIGN_OFFSET       0x104c
#define FLASH_FRDCTL_OFFSET             0x2000
#define FLASH_FSPRD_OFFSET              0x2004
#define FLASH_FEDACCTL1_OFFSET          0x2008
#define FLASH_FEDACSTAT_OFFSET          0x201c
#define FLASH_FBPROT_OFFSET             0x2030
#define FLASH_FBSE_OFFSET               0x2034
#define FLASH_FBBUSY_OFFSET             0x2038
#define FLASH_FBAC_OFFSET               0x203c
#define FLASH_FBFALLBACK_OFFSET         0x2040
#define FLASH_FBPRDY_OFFSET             0x2044
#define FLASH_FPAC1_OFFSET              0x2048
#define FLASH_FPAC2_OFFSET              0x204c
#define FLASH_FMAC_OFFSET               0x2050
#define FLASH_FMSTAT_OFFSET             0x2054
#define FLASH_FLOCK_OFFSET              0x2064
#define FLASH_FVREADCT_OFFSET           0x2080
#define FLASH_FVHVCT1_OFFSET            0x2084
#define FLASH_FVHVCT2_OFFSET            0x2088
#define FLASH_FVHVCT3_OFFSET            0x208c
#define FLASH_FVNVCT_OFFSET             0x2090
#define FLASH_FVSLP_OFFSET              0x2094
#define FLASH_FVWLCT_OFFSET             0x2098
#define FLASH_FEFUSECTL_OFFSET          0x209c
#define FLASH_FEFUSESTAT_OFFSET         0x20a0
#define FLASH_FEFUSEDATA_OFFSET         0x20a4
#define FLASH_FSEQPMP_OFFSET            0x20a8
#define FLASH_FBSTROBES_OFFSET          0x2100
#define FLASH_FPSTROBES_OFFSET          0x2104
#define FLASH_FBMODE_OFFSET             0x2108
#define FLASH_FTCR_OFFSET               0x210c
#define FLASH_FADDR_OFFSET              0x2110
#define FLASH_FTCTL_OFFSET              0x211c
#define FLASH_FWPWRITE0_OFFSET          0x2120
#define FLASH_FWPWRITE1_OFFSET          0x2124
#define FLASH_FWPWRITE2_OFFSET          0x2128
#define FLASH_FWPWRITE3_OFFSET          0x212c
#define FLASH_FWPWRITE4_OFFSET          0x2130
#define FLASH_FWPWRITE5_OFFSET          0x2134
#define FLASH_FWPWRITE6_OFFSET          0x2138
#define FLASH_FWPWRITE7_OFFSET          0x213c
#define FLASH_FWPWRITE_ECC_OFFSET       0x2140
#define FLASH_FSWSTAT_OFFSET            0x2144
#define FLASH_FSM_GLBCTL_OFFSET         0x2200
#define FLASH_FSM_STATE_OFFSET          0x2204
#define FLASH_FSM_STAT_OFFSET           0x2208
#define FLASH_FSM_CMD_OFFSET            0x220c
#define FLASH_FSM_PE_OSU_OFFSET         0x2210
#define FLASH_FSM_VSTAT_OFFSET          0x2214
#define FLASH_FSM_PE_VSU_OFFSET         0x2218
#define FLASH_FSM_CMP_VSU_OFFSET        0x221c
#define FLASH_FSM_EX_VAL_OFFSET         0x2220
#define FLASH_FSM_RD_H_OFFSET           0x2224
#define FLASH_FSM_P_OH_OFFSET           0x2228
#define FLASH_FSM_ERA_OH_OFFSET         0x222c
#define FLASH_FSM_SAV_PPUL_OFFSET       0x2230
#define FLASH_FSM_PE_VH_OFFSET          0x2234
#define FLASH_FSM_PRG_PW_OFFSET         0x2240
#define FLASH_FSM_ERA_PW_OFFSET         0x2244
#define FLASH_FSM_SAV_ERA_PUL_OFFSET    0x2254
#define FLASH_FSM_TIMER_OFFSET          0x2258
#define FLASH_FSM_MODE_OFFSET           0x225c
#define FLASH_FSM_PGM_OFFSET            0x2260
#define FLASH_FSM_ERA_OFFSET            0x2264
#define FLASH_FSM_PRG_PUL_OFFSET        0x2268
#define FLASH_FSM_ERA_PUL_OFFSET        0x226c
#define FLASH_FSM_STEP_SIZE_OFFSET      0x2270
#define FLASH_FSM_PUL_CNTR_OFFSET       0x2274
#define FLASH_FSM_EC_STEP_HEIGHT_OFFSET 0x2278
#define FLASH_FSM_ST_MACHINE_OFFSET     0x227c
#define FLASH_FSM_FLES_OFFSET           0x2280
#define FLASH_FSM_WR_ENA_OFFSET         0x2288
#define FLASH_FSM_ACC_PP_OFFSET         0x228c
#define FLASH_FSM_ACC_EP_OFFSET         0x2290
#define FLASH_FSM_ADDR_OFFSET           0x22a0
#define FLASH_FSM_SECTOR_OFFSET         0x22a4
#define FLASH_FMC_REV_ID_OFFSET         0x22a8
#define FLASH_FSM_ERR_ADDR_OFFSET       0x22ac
#define FLASH_FSM_PGM_MAXPUL_OFFSET     0x22b0
#define FLASH_FSM_EXECUTE_OFFSET        0x22b4
#define FLASH_FSM_SECTOR1_OFFSET        0x22c0
#define FLASH_FSM_SECTOR2_OFFSET        0x22c4
#define FLASH_FSM_BSLE0_OFFSET          0x22e0
#define FLASH_FSM_BSLE1_OFFSET          0x22e4
#define FLASH_FSM_BSLP0_OFFSET          0x22f0
#define FLASH_FSM_BSLP1_OFFSET          0x22f4
#define FLASH_FSM_PGM128_OFFSET         0x22f8  /* FMC FSM Enable 128-bit Wide Programming */
#define FLASH_FCFG_BANK_OFFSET          0x2400
#define FLASH_FCFG_WRAPPER_OFFSET       0x2404
#define FLASH_FCFG_BNK_TYPE_OFFSET      0x2408
#define FLASH_FCFG_B0_START_OFFSET      0x2410
#define FLASH_FCFG_B1_START_OFFSET      0x2414
#define FLASH_FCFG_B2_START_OFFSET      0x2418
#define FLASH_FCFG_B3_START_OFFSET      0x241c
#define FLASH_FCFG_B4_START_OFFSET      0x2420
#define FLASH_FCFG_B5_START_OFFSET      0x2424
#define FLASH_FCFG_B6_START_OFFSET      0x2428
#define FLASH_FCFG_B7_START_OFFSET      0x242c
#define FLASH_FCFG_B0_SSIZE0_OFFSET     0x2430

/* FLASH Register Addresses *************************************************************************/

/* FLASH Bitfield Definitions ***********************************************************************/

/* FLASH_STAT */

#define FLASH_STAT_POWER_MODE           (1 << 0)  /* Bit 0:  Low power state of flash sub-system */
#define FLASH_STAT_BUSY                 (1 << 1)  /* Bit 1:  Fast version of the FMC FMSTAT.BUSY bit */
#define FLASH_STAT_SAMHOLD_DIS          (1 << 2)  /* Bit 2:  Status of flash sample and hold sequencing logic */
#define FLASH_STAT_EFUSE_ERRCODE_SHIFT  (8)       /* Bits 8-12:  Same as EFUSEERROR.CODE */
#define FLASH_STAT_EFUSE_ERRCODE_MASK   (31 << FLASH_STAT_EFUSE_ERRCODE_SHIFT)
#define FLASH_STAT_SPRS_BYTE_NOT_OK     (1 << 13) /* Bit 13:  Efuse scanning resulted in scan chain Sparse byte error. */
#define FLASH_STAT_EFUSE_TIMEOUT        (1 << 14) /* Bit 14: Efuse scanning resulted in timeout error */
#define FLASH_STAT_EFUSE_BLANK          (1 << 15) /* Bit 15: Efuse scanning detected if fuse ROM is blank */

/* FLASH_CFG */

#define FLASH_CFG_DIS_IDLE              (1 << 0)  /* Bit 0 */
#define FLASH_CFG_DIS_STANDBY           (1 << 1)  /* Bit 1 */
#define FLASH_CFG_ENABLE_SWINTF         (1 << 3)  /* Bit 3 */
#define FLASH_CFG_DIS_READACCESS        (1 << 4)  /* Bit 4 */
#define FLASH_CFG_DIS_EFUSECLK          (1 << 5)  /* Bit 5 */
#define FLASH_CFG_STANDBY_PW_SEL_SHIFT  (6)       /* Bits 6-7 */
#define FLASH_CFG_STANDBY_PW_SEL_MASK   (3 << FLASH_CFG_STANDBY_PW_SEL_SHIFT)
#define FLASH_CFG_STANDBY_MODE_SEL      (1 << 8)  /* Bit 8 */

/* FLASH_SYSCODE_START */

#define FLASH_SYSCODE_START_SYSCODE_START_SHIFT (0)     /* Bits 0-5 */
#define FLASH_SYSCODE_START_SYSCODE_START_MASK  (0x3f << FLASH_SYSCODE_START_SYSCODE_START_SHIFT)

/* FLASH_FLASH_SIZE */

