apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_flash.h
#define FLASH_FLASH_SIZE_SECTORS_SHIFT  (0)       /* Bits 0-7 */
#define FLASH_FLASH_SIZE_SECTORS_MASK   (0xff << FLASH_FLASH_SIZE_SECTORS_SHIFT)

/* FLASH_FWLOCK */

#define FLASH_FWLOCK_FWLOCK_SHIFT       (0)       /* Bits 0-2 */
#define FLASH_FWLOCK_FWLOCK_MASK        (7 << FLASH_FWLOCK_FWLOCK_SHIFT)

/* FLASH_FWFLAG */

#define FLASH_FWFLAG_FWFLAG_SHIFT       (0)       /* Bits 0-2 */
#define FLASH_FWFLAG_FWFLAG_MASK        (7 << FLASH_FWFLAG_FWFLAG_SHIFT)

/* FLASH_EFUSE */

#define FLASH_EFUSE_DUMPWORD_SHIFT      (0)       /* Bits 0-5 */
#define FLASH_EFUSE_DUMPWORD_MASK       (0xffff << FLASH_EFUSE_DUMPWORD_SHIFT)
#define FLASH_EFUSE_INSTRUCTION_SHIFT   (24)      /* Bits 24-28 */
#define FLASH_EFUSE_INSTRUCTION_MASK    (31 << FLASH_EFUSE_INSTRUCTION_SHIFT)

/* FLASH_EFUSEADDR */

#define FLASH_EFUSEADDR_ROW_SHIFT       (0)       /* Bits 0-10 */
#define FLASH_EFUSEADDR_ROW_MASK        (0x7ff << FLASH_EFUSEADDR_ROW_SHIFT)
#define FLASH_EFUSEADDR_BLOCK_SHIFT     (11)      /* Bits 11-15 */
#define FLASH_EFUSEADDR_BLOCK_MASK      (31 << FLASH_EFUSEADDR_BLOCK_SHIFT)

/* FLASH_DATAUPPER */

#define FLASH_DATAUPPER_EEN             (1 << 0)  /* Bit 0 */
#define FLASH_DATAUPPER_R               (1 << 1)  /* Bit 1 */
#define FLASH_DATAUPPER_P               (1 << 2)  /* Bit 2 */
#define FLASH_DATAUPPER_SPARE_SHIFT     (3)       /* Bits 3-7 */
#define FLASH_DATAUPPER_SPARE_MASK      (31 << FLASH_DATAUPPER_SPARE_SHIFT)

/* FLASH_DATALOWER (32-bit value) */

/* FLASH_EFUSECFG */

#define FLASH_EFUSECFG_IDLEGATING       (1 << 8)  /* Bit 8 */

#define FLASH_EFUSECFG_GATING           (1 << 0)  /* Bit 0 */
#define FLASH_EFUSECFG_SLAVEPOWER_SHIFT (3)       /* Bits 3-4 */
#define FLASH_EFUSECFG_SLAVEPOWER_MASK  (3 << FLASH_EFUSECFG_SLAVEPOWER_SHIFT)

/* FLASH_EFUSESTAT */

#define FLASH_EFUSESTAT_RESETDONE       (1 << 0)  /* Bit 0 */

/* FLASH_ACC */

#define FLASH_ACC_ACCUMULATOR_SHIFT     (0)     /* Bits 0-23 */
#define FLASH_ACC_ACCUMULATOR_MASK      (0xffffff << FLASH_ACC_ACCUMULATOR_SHIFT)

/* FLASH_BOUNDARY */

#define FLASH_BOUNDARY_INPUTENABLE_SHIFT        (0)     /* Bits 0-3 */
#define FLASH_BOUNDARY_INPUTENABLE_MASK         (15 << FLASH_BOUNDARY_INPUTENABLE_SHIFT)
#define FLASH_BOUNDARY_SYS_WS_READ_STATES_SHIFT (4)     /* Bits 4-7 */
#define FLASH_BOUNDARY_SYS_WS_READ_STATES_MASK  (15 << FLASH_BOUNDARY_SYS_WS_READ_STATES_SHIFT)
#define FLASH_BOUNDARY_SYS_REPAIR_EN_SHIFT      (8)       /* Bits 8-9 */
#define FLASH_BOUNDARY_SYS_REPAIR_EN_MASK       (3 << FLASH_BOUNDARY_SYS_REPAIR_EN_SHIFT)
#define FLASH_BOUNDARY_SYS_DIEID_AUTOLOAD_EN    (1 << 10) /* Bit 10 */
#define FLASH_BOUNDARY_EFC_FDI                  (1 << 11) /* Bit 11 */
#define FLASH_BOUNDARY_SYS_ECC_OVERRIDE_EN      (1 << 12) /* Bit 12 */
#define FLASH_BOUNDARY_SYS_ECC_SELF_TEST_EN     (1 << 13) /* Bit 13 */
#define FLASH_BOUNDARY_OUTPUTENABLE_SHIFT       (14)      /* Bits 14-17 */
#define FLASH_BOUNDARY_OUTPUTENABLE_MASK        (15 << FLASH_BOUNDARY_OUTPUTENABLE_SHIFT)
#define FLASH_BOUNDARY_EFC_AUTOLOAD_ERROR       (1 << 18) /* Bit 18 */
#define FLASH_BOUNDARY_EFC_INSTRUCTION_ERROR    (1 << 19) /* Bit 19 */
#define FLASH_BOUNDARY_EFC_INSTRUCTION_INFO     (1 << 20) /* Bit 20 */
#define FLASH_BOUNDARY_EFC_SELF_TEST_ERROR      (1 << 21) /* Bit 21 */
#define FLASH_BOUNDARY_SPARE                    (1 << 22) /* Bit 22 */
#define FLASH_BOUNDARY_DISROW0                  (1 << 23) /* Bit 23 */

/* FLASH_EFUSEFLAG */

#define FLASH_EFUSEFLAG_KEY             (1 << 0)  /* Bit 0 */

/* FLASH_EFUSEKEY (32-bit code) */

/* FLASH_EFUSERELEASE */

#define FLASH_EFUSERELEASE_EFUSEDAY_SHIFT   (0)     /* Bits 0-4 */
#define FLASH_EFUSERELEASE_EFUSEDAY_MASK    (31 << FLASH_EFUSERELEASE_EFUSEDAY_SHIFT)
#define FLASH_EFUSERELEASE_EFUSEMONTH_SHIFT (5)     /* Bits 5-8 */
#define FLASH_EFUSERELEASE_EFUSEMONTH_MASK  (15 << FLASH_EFUSERELEASE_EFUSEMONTH_SHIFT)
#define FLASH_EFUSERELEASE_EFUSEYEAR_SHIFT  (9)     /* Bits 9-15 */
#define FLASH_EFUSERELEASE_EFUSEYEAR_MASK   (0x7f << FLASH_EFUSERELEASE_EFUSEYEAR_SHIFT)
#define FLASH_EFUSERELEASE_ODPDAY_SHIFT     (16)     /* Bits 16-20 */
#define FLASH_EFUSERELEASE_ODPDAY_MASK      (31 << FLASH_EFUSERELEASE_ODPDAY_SHIFT)
#define FLASH_EFUSERELEASE_ODPMONTH_SHIFT   (21)     /* Bits 21-24 */
#define FLASH_EFUSERELEASE_ODPMONTH_MASK    (15 << FLASH_EFUSERELEASE_ODPMONTH_SHIFT)
#define FLASH_EFUSERELEASE_ODPYEAR_SHIFT    (25)     /* Bits 25-31 */
#define FLASH_EFUSERELEASE_ODPYEAR_MASK     (0x7f << FLASH_EFUSERELEASE_ODPYEAR_SHIFT)

/* FLASH_EFUSEPINS */

#define FLASH_EFUSEPINS_SYS_WS_READ_STATES_SHIFT (0)       /* Bits 0-3 */
#define FLASH_EFUSEPINS_SYS_WS_READ_STATES_MASK  (15 << FLASH_EFUSEPINS_SYS_WS_READ_STATES_SHIFT)
#define FLASH_EFUSEPINS_SYS_REPAIR_EN_SHIFT      (4)       /* Bits 4-5 */
#define FLASH_EFUSEPINS_SYS_REPAIR_EN_MASK       (3 << FLASH_EFUSEPINS_SYS_REPAIR_EN_SHIFT)
#define FLASH_EFUSEPINS_SYS_DIEID_AUTOLOAD_EN    (1 << 6)  /* Bit 6 */
#define FLASH_EFUSEPINS_EFC_FCLRZ                (1 << 7)  /* Bit 7 */
#define FLASH_EFUSEPINS_EFC_READY                (1 << 8)  /* Bit 8 */
#define FLASH_EFUSEPINS_SYS_ECC_OVERRIDE_EN      (1 << 9)  /* Bit 9 */
#define FLASH_EFUSEPINS_EFC_AUTOLOAD_ERROR       (1 << 10) /* Bit 10 */
#define FLASH_EFUSEPINS_EFC_INSTRUCTION_ERROR    (1 << 11) /* Bit 11 */
#define FLASH_EFUSEPINS_EFC_INSTRUCTION_INFO     (1 << 12) /* Bit 12 */
#define FLASH_EFUSEPINS_SYS_ECC_SELF_TEST_EN     (1 << 13) /* Bit 13 */
#define FLASH_EFUSEPINS_EFC_SELF_TEST_ERROR      (1 << 14) /* Bit 14 */
#define FLASH_EFUSEPINS_EFC_SELF_TEST_DONE       (1 << 15) /* Bit 15 */

/* FLASH_EFUSECRA */

#define FLASH_EFUSECRA_DATA_SHIFT       (0)       /* Bits 0-5 */
#define FLASH_EFUSECRA_DATA_MASK        (0x3f << FLASH_EFUSECRA_DATA_SHIFT)

/* FLASH_EFUSEREAD */

#define FLASH_EFUSEREAD_MARGIN_SHIFT    (0)       /* Bits 0-1 */
#define FLASH_EFUSEREAD_MARGIN_MASK     (3 << FLASH_EFUSEREAD_MARGIN_SHIFT)
#define FLASH_EFUSEREAD_SPARE           (1 << 2)  /* Bit 2 */
#define FLASH_EFUSEREAD_DEBUG           (1 << 3)  /* Bit 3 */
#define FLASH_EFUSEREAD_READCLOCK_SHIFT (4)       /* Bits 4-7 */
#define FLASH_EFUSEREAD_READCLOCK_MASK  (15 << FLASH_EFUSEREAD_READCLOCK_SHIFT)
#define FLASH_EFUSEREAD_DATABIT_SHIFT   (8)       /* Bits 8-9 */
#define FLASH_EFUSEREAD_DATABIT_MASK    (3 << FLASH_EFUSEREAD_DATABIT_SHIFT)

/* FLASH_EFUSEPROGRAM */

#define FLASH_EFUSEPROGRAM_WRITECLOCK_SHIFT (0)       /* Bits 0-8 */
#define FLASH_EFUSEPROGRAM_ITERATIONS_SHIFT (9)       /* Bits 9-12 */
#define FLASH_EFUSEPROGRAM_ITERATIONS_MASK  (15 << FLASH_EFUSEPROGRAM_ITERATIONS_SHIFT)
#define FLASH_EFUSEPROGRAM_WRITECLOCK_MASK  (0x1ff << FLASH_EFUSEPROGRAM_WRITECLOCK_SHIFT)
#define FLASH_EFUSEPROGRAM_VPPTOVDD         (1 << 13) /* Bit 13 */
#define FLASH_EFUSEPROGRAM_CLOCKSTALL_SHIFT (14)      /* Bits 14-29 */
#define FLASH_EFUSEPROGRAM_CLOCKSTALL_MASK  (0xffff << FLASH_EFUSEPROGRAM_CLOCKSTALL_SHIFT)
#define FLASH_EFUSEPROGRAM_COMPAREDISABLE   (1 << 30) /* Bit 30 */

