apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_flash.h
/* FLASH_EFUSEERROR */

#define FLASH_EFUSEERROR_CODE_SHIFT     (0)       /* Bits 0-4 */
#define FLASH_EFUSEERROR_CODE_MASK      (31 << FLASH_EFUSEERROR_CODE_SHIFT)
#define FLASH_EFUSEERROR_DONE           (1 << 5)  /* Bit 5 */

/* FLASH_SINGLEBIT */

#define FLASH_SINGLEBIT_FROM0           (1 << 0)  /* Bit 0 */
#define FLASH_SINGLEBIT_FROMN_SHIFT     (1)       /* Bits 1-31 */
#define FLASH_SINGLEBIT_FROMN_MASK      (0x7fffffff << FLASH_SINGLEBIT_FROMN_SHIFT)

/* FLASH_TWOBIT */

#define FLASH_TWOBIT_FROM0              (1 << 0)  /* Bit 0 */
#define FLASH_TWOBIT_FROMN_SHIFT        (1)       /* Bits 1-31 */
#define FLASH_TWOBIT_FROMN_MASK         (0x7fffffff << FLASH_TWOBIT_FROMN_SHIFT)

/* FLASH_SELFTESTCYC (32-bit value) */
/* FLASH_SELFTESTSIGN (32-bit value) */

/* FLASH_FRDCTL */

#define FLASH_FRDCTL_RWAIT_SHIFT        (8)       /* Bits 8-11 */
#define FLASH_FRDCTL_RWAIT_MASK         (15 << FLASH_FRDCTL_RWAIT_SHIFT)

/* FLASH_FSPRD */

#define FLASH_FSPRD_RM0                 (1 << 0)  /* Bit 0 */
#define FLASH_FSPRD_RM1                 (1 << 1)  /* Bit 1 */
#define FLASH_FSPRD_RMBSEM_SHIFT        (8)       /* Bits 8-15 */
#define FLASH_FSPRD_RMBSEM_MASK         (0xff << FLASH_FSPRD_RMBSEM_SHIFT)

/* FLASH_FEDACCTL1 */

#define FLASH_FEDACCTL1_SUSP_IGNR       (1 << 24) /* Bit 24 */

/* FLASH_FEDACSTAT */

#define FLASH_FEDACSTAT_FSM_DONE        (1 << 24)  /* Bit 24 */
#define FLASH_FEDACSTAT_RVF_INT         (1 << 25)  /* Bit 25 */

/* FLASH_FBPROT */

#define FLASH_FBPROT_PROTL1DIS          (1 << 0)  /* Bit 0 */

/* FLASH_FBSE */

#define FLASH_FBSE_BSE_SHIFT            (0)       /* Bits 0-15 */
#define FLASH_FBSE_BSE_MASK             (0xffff << FLASH_FBSE_BSE_SHIFT)

/* FLASH_FBBUSY */

#define FLASH_FBBUSY_BUSY_SHIFT         (0)       /* Bits 0-7 */
#define FLASH_FBBUSY_BUSY_MASK          (0xff << FLASH_FBBUSY_BUSY_SHIFT)

/* FLASH_FBAC */

#define FLASH_FBAC_VREADS_SHIFT         (0)       /* Bits 0-7 */
#define FLASH_FBAC_VREADS_MASK          (0xff << FLASH_FBAC_VREADS_SHIFT)
#define FLASH_FBAC_BAGP_SHIFT           (8)       /* Bits 8-15 */
#define FLASH_FBAC_BAGP_MASK            (0xff << FLASH_FBAC_BAGP_SHIFT)
#define FLASH_FBAC_OTPPROTDIS           (1 << 16) /* Bit 16 */

/* FLASH_FBFALLBACK */

#define FLASH_FBFALLBACK_BANKPWR0_SHIFT   (0)     /* Bits 0-1 */
#define FLASH_FBFALLBACK_BANKPWR0_MASK    (3 << FLASH_FBFALLBACK_BANKPWR0_SHIFT)
#define FLASH_FBFALLBACK_BANKPWR1_SHIFT   (2)     /* Bits 2-3 */
#define FLASH_FBFALLBACK_BANKPWR1_MASK    (3 << FLASH_FBFALLBACK_BANKPWR1_SHIFT)
#define FLASH_FBFALLBACK_BANKPWR2_SHIFT   (4)     /* Bits 4-5 */
#define FLASH_FBFALLBACK_BANKPWR2_MASK    (3 << FLASH_FBFALLBACK_BANKPWR2_SHIFT)
#define FLASH_FBFALLBACK_BANKPWR3_SHIFT   (6)     /* Bits 6-7 */
#define FLASH_FBFALLBACK_BANKPWR3_MASK    (3 << FLASH_FBFALLBACK_BANKPWR3_SHIFT)
#define FLASH_FBFALLBACK_BANKPWR4_SHIFT   (8)     /* Bits 8-9 */
#define FLASH_FBFALLBACK_BANKPWR4_MASK    (3 << FLASH_FBFALLBACK_BANKPWR4_SHIFT)
#define FLASH_FBFALLBACK_BANKPWR5_SHIFT   (10)     /* Bits 10-11 */
#define FLASH_FBFALLBACK_BANKPWR5_MASK    (3 << FLASH_FBFALLBACK_BANKPWR5_SHIFT)
#define FLASH_FBFALLBACK_BANKPWR6_SHIFT   (12)     /* Bits 12-13 */
#define FLASH_FBFALLBACK_BANKPWR6_MASK    (3 << FLASH_FBFALLBACK_BANKPWR6_SHIFT)
#define FLASH_FBFALLBACK_BANKPWR7_SHIFT   (14)     /* Bits 14-15 */
#define FLASH_FBFALLBACK_BANKPWR7_MASK    (3 << FLASH_FBFALLBACK_BANKPWR7_SHIFT)
#define FLASH_FBFALLBACK_REG_PWRSAV_SHIFT (16)     /* Bits 16-19 */
#define FLASH_FBFALLBACK_REG_PWRSAV_MASK  (15 << FLASH_FBFALLBACK_REG_PWRSAV_SHIFT)
#define FLASH_FBFALLBACK_FSM_PWRSAV_SHIFT (24)     /* Bits 24-27 */
#define FLASH_FBFALLBACK_FSM_PWRSAV_MASK  (15 << FLASH_FBFALLBACK_FSM_PWRSAV_SHIFT)

/* FLASH_FBPRDY */

#define FLASH_FBPRDY_BANKRDY            (1 << 0)  /* Bit 0 */
#define FLASH_FBPRDY_PUMPRDY            (1 << 15) /* Bit 15 */
#define FLASH_FBPRDY_BANKBUSY           (1 << 16) /* Bit 16 */

/* FLASH_FPAC1 */

#define FLASH_FPAC1_PUMPPWR_SHIFT       (0)       /* Bits 0-1 */
#define FLASH_FPAC1_PUMPPWR_MASK        (3 << FLASH_FPAC1_PUMPPWR_SHIFT)
#define FLASH_FPAC1_PUMPRESET_PW_SHIFT  (4)       /* Bits 4-15 */
#define FLASH_FPAC1_PUMPRESET_PW_MASK   (0xfff << FLASH_FPAC1_PUMPRESET_PW_SHIFT)
#define FLASH_FPAC1_PSLEEPTDIS_SHIFT    (16)      /* Bits 16-17 */
#define FLASH_FPAC1_PSLEEPTDIS_MASK     (0xfff << FLASH_FPAC1_PSLEEPTDIS_SHIFT)

/* FLASH_FPAC2 */

#define FLASH_FPAC2_PAGP_SHIFT          (0)     /* Bits 0-25 */
#define FLASH_FPAC2_PAGP_MASK           (0xffff << FLASH_FPAC2_PAGP_SHIFT)

/* FLASH_FMAC */

#define FLASH_FMAC_BANK_SHIFT           (0)     /* Bits 0-2 */
#define FLASH_FMAC_BANK_MASK            (7 << FLASH_FMAC_BANK_SHIFT)

/* FLASH_FMSTAT */

#define FLASH_FMSTAT_SLOCK              (1 << 0)  /* Bit 0 */
#define FLASH_FMSTAT_PSUSP              (1 << 1)  /* Bit 1 */
#define FLASH_FMSTAT_ESUSP              (1 << 2)  /* Bit 2 */
#define FLASH_FMSTAT_VOLSTAT            (1 << 3)  /* Bit 3 */
#define FLASH_FMSTAT_CSTAT              (1 << 4)  /* Bit 4 */
#define FLASH_FMSTAT_INVDAT             (1 << 5)  /* Bit 5 */
#define FLASH_FMSTAT_PGM                (1 << 6)  /* Bit 6 */
#define FLASH_FMSTAT_ERS                (1 << 7)  /* Bit 7 */
#define FLASH_FMSTAT_BUSY               (1 << 8)  /* Bit 8 */
#define FLASH_FMSTAT_CV                 (1 << 9)  /* Bit 9 */
#define FLASH_FMSTAT_EV                 (1 << 10) /* Bit 10 */
#define FLASH_FMSTAT_PCV                (1 << 11) /* Bit 11 */
#define FLASH_FMSTAT_PGV                (1 << 12) /* Bit 12 */
#define FLASH_FMSTAT_DBF                (1 << 13) /* Bit 13 */
#define FLASH_FMSTAT_ILA                (1 << 14) /* Bit 14 */
#define FLASH_FMSTAT_RVF                (1 << 15) /* Bit 15 */
#define FLASH_FMSTAT_RDVER              (1 << 16) /* Bit 16 */
#define FLASH_FMSTAT_RVSUSP             (1 << 17) /* Bit 17 */

/* FLASH_FLOCK */

#define FLASH_FLOCK_ENCOM_SHIFT         (0)       /* Bits 0-15 */
#define FLASH_FLOCK_ENCOM_MASK          (0xffff << FLASH_FLOCK_ENCOM_SHIFT)

/* FLASH_FVREADCT */

#define FLASH_FVREADCT_VREADCT_SHIFT    (0)       /* Bits 0-3 */
#define FLASH_FVREADCT_VREADCT_MASK     (15 << FLASH_FVREADCT_VREADCT_SHIFT)

/* FLASH_FVHVCT1 */

#define FLASH_FVHVCT1_VHVCT_PV_SHIFT    (0)       /* Bits 0-3 */
#define FLASH_FVHVCT1_VHVCT_PV_MASK     (15 << FLASH_FVHVCT1_VHVCT_PV_SHIFT)
#define FLASH_FVHVCT1_TRIM13_PV_SHIFT   (4)       /* Bits 4-7 */
#define FLASH_FVHVCT1_TRIM13_PV_MASK    (15 << FLASH_FVHVCT1_TRIM13_PV_SHIFT)
#define FLASH_FVHVCT1_VHVCT_E_SHIFT     (16)      /* Bits 16-19 */
#define FLASH_FVHVCT1_VHVCT_E_MASK      (15 << FLASH_FVHVCT1_VHVCT_E_SHIFT)
#define FLASH_FVHVCT1_TRIM13_E_SHIFT    (20)      /* Bits 20-23 */
#define FLASH_FVHVCT1_TRIM13_E_MASK     (15 << FLASH_FVHVCT1_TRIM13_E_SHIFT)

/* FLASH_FVHVCT2 */

#define FLASH_FVHVCT2_VHVCT_P_SHIFT     (16)      /* Bits 16-19 */
#define FLASH_FVHVCT2_VHVCT_P_MASK      (15 << FLASH_FVHVCT2_VHVCT_P_SHIFT)
#define FLASH_FVHVCT2_TRIM13_P_SHIFT    (20)      /* Bits 20-23 */
#define FLASH_FVHVCT2_TRIM13_P_MASK     (15 << FLASH_FVHVCT2_TRIM13_P_SHIFT)

/* FLASH_FVHVCT3 */

#define FLASH_FVHVCT3_VHVCT_READ_SHIFT  (0)       /* Bits 0-3 */
#define FLASH_FVHVCT3_VHVCT_READ_MASK   (15 << FLASH_FVHVCT3_VHVCT_READ_SHIFT)
#define FLASH_FVHVCT3_WCT_SHIFT         (16)      /* Bits 16-19 */
#define FLASH_FVHVCT3_WCT_MASK          (15 << FLASH_FVHVCT3_WCT_SHIFT)

/* FLASH_FVNVCT */

#define FLASH_FVNVCT_VIN_CT_SHIFT       (0)       /* Bits 0-4 */
#define FLASH_FVNVCT_VIN_CT_MASK        (31 << FLASH_FVNVCT_VIN_CT_SHIFT)
#define FLASH_FVNVCT_VCG2P5CT_SHIFT     (8)       /* Bits 8-12 */
#define FLASH_FVNVCT_VCG2P5CT_MASK      (31 << FLASH_FVNVCT_VCG2P5CT_SHIFT)

/* FLASH_FVSLP */

#define FLASH_FVSLP_VSL_P_SHIFT         (12)      /* Bits 12-15 */
#define FLASH_FVSLP_VSL_P_MASK          (15 << FLASH_FVSLP_VSL_P_SHIFT)

/* FLASH_FVWLCT */

