apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_flash.h
#define FLASH_FVWLCT_VWLCT_P_SHIFT      (0)       /* Bits 0-4 */
#define FLASH_FVWLCT_VWLCT_P_MASK       (31 << FLASH_FVWLCT_VWLCT_P_SHIFT)

/* FLASH_FEFUSECTL */

#define FLASH_FEFUSECTL_EFUSE_EN_SHIFT  (0)       /* Bits 0-3 */
#define FLASH_FEFUSECTL_EFUSE_EN_MASK   (15 << FLASH_FEFUSECTL_EFUSE_EN_SHIFT)
#define FLASH_FEFUSECTL_EF_TEST         (1 << 4)  /* Bit 4 */
#define FLASH_FEFUSECTL_EF_CLRZ         (1 << 8)  /* Bit 8 */
#define FLASH_FEFUSECTL_BP_SEL          (1 << 16) /* Bit 16 */
#define FLASH_FEFUSECTL_WRITE_EN        (1 << 17) /* Bit 17 */
#define FLASH_FEFUSECTL_CHAIN_SEL_SHIFT (24)      /* Bits 24-26 */
#define FLASH_FEFUSECTL_CHAIN_SEL_MASK  (7 << FLASH_FEFUSECTL_CHAIN_SEL_SHIFT)

/* FLASH_FEFUSESTAT */

#define FLASH_FEFUSESTAT_SHIFT_DONE     (1 << 0)  /* Bit 0 */

/* FLASH_FEFUSEDATA (32-bit value) */

/* FLASH_FSEQPMP */

#define FLASH_FSEQPMP_VIN_BY_PASS       (1 << 8)  /* Bit 8 */
#define FLASH_FSEQPMP_VIN_AT_X_SHIFT    (12)      /* Bits 12-14 */
#define FLASH_FSEQPMP_VIN_AT_X_MASK     (7 << FLASH_FSEQPMP_VIN_AT_X_SHIFT)
#define FLASH_FSEQPMP_TRIM_0P8_SHIFT    (16)      /* Bits 16-19 */
#define FLASH_FSEQPMP_TRIM_0P8_MASK     (15 << FLASH_FSEQPMP_TRIM_0P8_SHIFT)
#define FLASH_FSEQPMP_TRIM_1P7_SHIFT    (20)      /* Bits 20-21 */
#define FLASH_FSEQPMP_TRIM_1P7_MASK     (3 << FLASH_FSEQPMP_TRIM_1P7_SHIFT)
#define FLASH_FSEQPMP_TRIM_3P4_SHIFT    (24)      /* Bits 24-27 */
#define FLASH_FSEQPMP_TRIM_3P4_MASK     (15 << FLASH_FSEQPMP_TRIM_3P4_SHIFT)

/* FLASH_FBSTROBES */

#define FLASH_FBSTROBES_TEZ             (1 << 2)  /* Bit 2 */
#define FLASH_FBSTROBES_OTP             (1 << 3)  /* Bit 3 */
#define FLASH_FBSTROBES_TI_OTP          (1 << 4)  /* Bit 4 */
#define FLASH_FBSTROBES_PRECOL          (1 << 5)  /* Bit 5 */
#define FLASH_FBSTROBES_NOCOLRED        (1 << 6)  /* Bit 6 */
#define FLASH_FBSTROBES_CTRLENZ         (1 << 8)  /* Bit 8 */
#define FLASH_FBSTROBES_FLCLKEN         (1 << 16) /* Bit 16 */
#define FLASH_FBSTROBES_RWAIT_FLCLK     (1 << 17) /* Bit 17 */
#define FLASH_FBSTROBES_RWAIT2_FLCLK    (1 << 18) /* Bit 18 */
#define FLASH_FBSTROBES_ECBIT           (1 << 24) /* Bit 24 */

/* FLASH_FPSTROBES */

#define FLASH_FPSTROBES_V5PWRDNZ        (1 << 0)  /* Bit 0 */
#define FLASH_FPSTROBES_V3PWRDNZ        (1 << 1)  /* Bit 1 */
#define FLASH_FPSTROBES_EXECUTEZ        (1 << 8)  /* Bit 8 */

/* FLASH_FBMODE */

#define FLASH_FBMODE_MODE_SHIFT         (0)       /* Bits 0-2 */
#define FLASH_FBMODE_MODE_MASK          (7 << FLASH_FBMODE_MODE_SHIFT)

/* FLASH_FTCR */

#define FLASH_FTCR_TCR_SHIFT            (0)       /* Bits 0-6 */
#define FLASH_FTCR_TCR_MASK             (0x7f << FLASH_FTCR_TCR_SHIFT)

/* FLASH_FADDR (32-bit value) */

/* FLASH_FTCTL */

#define FLASH_FTCTL_TEST_EN             (1 << 1)  /* Bit 1 */
#define FLASH_FTCTL_WDATA_BLK_CLR       (1 << 16) /* Bit 16 */

/* FLASH_FWPWRITE0 (32-bit value) */
/* FLASH_FWPWRITE1 (32-bit value) */
/* FLASH_FWPWRITE2 (32-bit value) */
/* FLASH_FWPWRITE3 (32-bit value) */
/* FLASH_FWPWRITE4 (32-bit value) */
/* FLASH_FWPWRITE5 (32-bit value) */
/* FLASH_FWPWRITE6 (32-bit value) */
/* FLASH_FWPWRITE7 (32-bit value) */

/* FLASH_FWPWRITE_ECC */

#define FLASH_FWPWRITE_ECC_ECCBYTES31_24_SHIFT (0)       /* Bits 0-7 */
#define FLASH_FWPWRITE_ECC_ECCBYTES31_24_MASK  (0xff << FLASH_FWPWRITE_ECC_ECCBYTES31_24_SHIFT)
#define FLASH_FWPWRITE_ECC_ECCBYTES23_16_SHIFT (8)       /* Bits 8-15 */
#define FLASH_FWPWRITE_ECC_ECCBYTES23_16_MASK  (0xff << FLASH_FWPWRITE_ECC_ECCBYTES23_16_SHIFT)
#define FLASH_FWPWRITE_ECC_ECCBYTES15_08_SHIFT (16)      /* Bits 16-23 */
#define FLASH_FWPWRITE_ECC_ECCBYTES15_08_MASK  (0xff << FLASH_FWPWRITE_ECC_ECCBYTES15_08_SHIFT)
#define FLASH_FWPWRITE_ECC_ECCBYTES07_00_SHIFT (24)      /* Bits 24-31 */
#define FLASH_FWPWRITE_ECC_ECCBYTES07_00_MASK  (0xff << FLASH_FWPWRITE_ECC_ECCBYTES07_00_SHIFT)

/* FLASH_FSWSTAT */

#define FLASH_FSWSTAT_SAFELV            (1 << 0)  /* Bit 0 */

/* FLASH_FSM_GLBCTL */

#define FLASH_FSM_GLBCTL_CLKSEL         (1 << 0)  /* Bit 0 */

/* FLASH_FSM_STATE */

#define FLASH_FSM_STATE_OTP_ACT         (1 << 6)  /* Bit 6 */
#define FLASH_FSM_STATE_TIOTP_ACT       (1 << 7)  /* Bit 7 */
#define FLASH_FSM_STATE_FSM_ACT         (1 << 8)  /* Bit 8 */
#define FLASH_FSM_STATE_EXECUTEZ        (1 << 10) /* Bit 10 */
#define FLASH_FSM_STATE_CTRLENZ         (1 << 11) /* Bit 11 */

/* FLASH_FSM_STAT */

#define FLASH_FSM_STAT_INV_DAT          (1 << 0)  /* Bit 0 */
#define FLASH_FSM_STAT_OVR_PUL_CNT      (1 << 1)  /* Bit 1 */
#define FLASH_FSM_STAT_NON_OP           (1 << 2)  /* Bit 2 */

/* FLASH_FSM_CMD */

#define FLASH_FSM_CMD_FSMCMD_SHIFT      (0)       /* Bits 0-5 */
#define FLASH_FSM_CMD_FSMCMD_MASK       (0x3f << FLASH_FSM_CMD_FSMCMD_SHIFT)

/* FLASH_FSM_PE_OSU */

#define FLASH_FSM_PE_OSU_ERA_OSU_SHIFT  (0)       /* Bits 0-7 */
#define FLASH_FSM_PE_OSU_ERA_OSU_MASK   (0xff << FLASH_FSM_PE_OSU_ERA_OSU_SHIFT)
#define FLASH_FSM_PE_OSU_PGM_OSU_SHIFT  (8)       /* Bits 8-15 */
#define FLASH_FSM_PE_OSU_PGM_OSU_MASK   (0xff << FLASH_FSM_PE_OSU_PGM_OSU_SHIFT)

/* FLASH_FSM_VSTAT */

#define FLASH_FSM_VSTAT_VSTAT_CNT_SHIFT (12)      /* Bits 12-15 */
#define FLASH_FSM_VSTAT_VSTAT_CNT_MASK  (15 << FLASH_FSM_VSTAT_VSTAT_CNT_SHIFT)

/* FLASH_FSM_PE_VSU */

#define FLASH_FSM_PE_VSU_PGM_VSU_SHIFT  (8)       /* Bits 8-15 */
#define FLASH_FSM_PE_VSU_PGM_VSU_MASK   (0xff << FLASH_FSM_PE_VSU_PGM_VSU_SHIFT)
#define FLASH_FSM_PE_VSU_ERA_VSU_SHIFT  (0)       /* Bits 0-7 */
#define FLASH_FSM_PE_VSU_ERA_VSU_MASK   (0xff << FLASH_FSM_PE_VSU_ERA_VSU_SHIFT)

/* FLASH_FSM_CMP_VSU */

#define FLASH_FSM_CMP_VSU_ADD_EXZ_SHIFT (12)      /* Bits 12-15 */
#define FLASH_FSM_CMP_VSU_ADD_EXZ_MASK  (15<< FLASH_FSM_CMP_VSU_ADD_EXZ_SHIFT)

/* FLASH_FSM_EX_VAL */

#define FLASH_FSM_EX_VAL_EXE_VALD_SHIFT (0)       /* Bits 0-7 */
#define FLASH_FSM_EX_VAL_EXE_VALD_MASK  (0xff << FLASH_FSM_EX_VAL_EXE_VALD_SHIFT)
#define FLASH_FSM_EX_VAL_REP_VSU_SHIFT  (8)       /* Bits 8-15 */
#define FLASH_FSM_EX_VAL_REP_VSU_MASK   (0xff << FLASH_FSM_EX_VAL_REP_VSU_SHIFT)

/* FLASH_FSM_RD_H */

#define FLASH_FSM_RD_H_RD_H_SHIFT       (0)       /* Bits 0-7 */
#define FLASH_FSM_RD_H_RD_H_MASK        (0xff << FLASH_FSM_RD_H_RD_H_SHIFT)

/* FLASH_FSM_P_OH */

